       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       AUTHOR. osawa-koki

       PROCEDURE DIVISION.

       DISPLAY "Hello, World!".

       STOP RUN.
